SST5/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
#include "../constant/flowProperties"

forceCoeffs1
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (motorBikeGroup);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    liftDir         ${liftDir};

    dragDir         ${dragDir};
    CofR            (0.4385 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         ${Umag};
    lRef            0.2265;        // Wheelbase length
    Aref            0.05455;        // Estimated
}




// ************************************************************************* //
